КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСпособПодтвержденияПолномочий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>ИсключениеДляОтдельныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНастройки</name>
    <comment>Для метрик</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп/Module.bsl
Функция Ядро() Экспорт

	Возврат КонтурЛогистика_ИнтеграцияДиадокСервер.Ядро();
	
КонецФункции

Функция ПараметрыСервисаДиадок(boxID) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииПоОрганизации(, boxID)
	
КонецФункции

Функция Токен(boxID) Экспорт

	Возврат КонтурЛогистика_ИнтеграцияДиадокСервер.Токен(boxID)	

КонецФункции

Функция ПодписыватьНаСервере(ОрганизацияДиадок, Пользователь1С, ДатаПодписи = Неопределено) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ПодписыватьНаСервере(ОрганизацияДиадок, Пользователь1С, ДатаПодписи);
	
КонецФункции

Функция ПодписыватьФайлНаСервере(Файл) Экспорт
	
	Возврат ПодписыватьНаСервере(Файл.Отправитель, Файл.ПользовательПодписант);
	
КонецФункции  

Функция ДанныеСертификатаДляПодписания(ОрганизацияДиадок, Пользователь1С, ДатаПодписи = Неопределено, ИспользоватьТолькоСерверные = Ложь, ДокументОбъектИлиСсылка = Неопределено, ДопПараметр = Неопределено) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ДанныеСертификатаДляПодписания(
		ОрганизацияДиадок, Пользователь1С, ДатаПодписи, ИспользоватьТолькоСерверные, ДокументОбъектИлиСсылка, ДопПараметр);
	
КонецФункции

Функция ДанныеСертификатаДляПодписанияФайла(Файл, ИспользоватьТолькоСерверные = Ложь) Экспорт
	
	Возврат ДанныеСертификатаДляПодписания(Файл.Отправитель, Файл.ПользовательПодписант,,
		ИспользоватьТолькоСерверные, Файл.СвязанныйДокумент, Файл.ПараметрНастроекПодписания);
	
КонецФункции

Функция ДанныеСертификатаДляСогласованияФайла(Файл, ИспользоватьТолькоСерверные = Ложь) Экспорт
	
	ДанныеПодписанта = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		Файл.ГлавныйДокумент, "ПользовательПодписант, ПараметрНастроекПодписания");
	
	ДанныеСертификата = ДанныеСертификатаДляПодписания(Файл.Получатель, ДанныеПодписанта.ПользовательПодписант,,
		ИспользоватьТолькоСерверные, Файл.СвязанныйДокумент, ДанныеПодписанта.ПараметрНастроекПодписания);
	
	ДанныеСертификата.Вставить("ПользовательПодписант", ДанныеПодписанта.ПользовательПодписант);
	ДанныеСертификата.Вставить("ПараметрНастроекПодписания", ДанныеПодписанта.ПараметрНастроекПодписания);
	
	Возврат ДанныеСертификата;
	
КонецФункции

Функция ПолучитьПредставлениеСертификата(ДанныеСертификата) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ПолучитьПредставлениеСертификата(ДанныеСертификата);
	
КонецФункции

Функция ПереходНаУССостоялся(ТипЛогистики) Экспорт
	
	ДатаНачалаДействияУС = КонтурЛогистика_ФункциональныеОпции.ДатаНачалаДействияУС(ТипЛогистики);
	
	Если Не ЗначениеЗаполнено(ДатаНачалаДействияУС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущаяДатаСеанса() >= ДатаНачалаДействияУС;
			
КонецФункции
